# <font color=#f94343>What is Pandas?<font>

In [1]:
import pandas as pd

In [9]:
data_frame = pd.read_csv('../ML/dataset/titanic/test.csv')

In [11]:
data_frame.head(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q

In [12]:
data_frame.tail(3)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

series 는 column이며 column으로 구성된 게 data frame. 

데이터프레임은 시리즈의 결합체이다. 리스트로 만든다.

In [15]:
list_tmp = [1,2,3]
list_tmp

[1, 2, 3]

In [16]:
s1 = pd.core.series.Series([1,2,3])

In [17]:
s2 = pd.core.series.Series(['one','two','three'])

In [18]:
pd.DataFrame( data=dict(num=s1, word=s2) )

   num   word
0    1    one
1    2    two
2    3  three

# <font color=#f94343>Load dataset from files<font>

In [19]:
!conda list | grep pandas

pandas                    0.23.4           py37h830ac7b_0

In [2]:
import pandas as pd

In [21]:
df = pd.read_csv('../ML/dataset/titanic/test.csv')

In [25]:
df.head(2)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S


다른 파일도 불러올 수 있다.

쉼표가 아니라 탭으로 구분되어 있다면? **delimiter에 인자 전달**
<pre><code>pd.read_csv('file', delimiter='\t')</code></pre>

만약 컬럼의 헤더가 없다면? **header=None, names=[list]**
<pre><code>
df = pd.read_csv('file', header=None)
df.columns = ['name1', 'name2', 'name3']

#한 번에 하려면?
df = pd.read_csv('file', header=None, names= ['name1', 'name2', 'name3'])
</code></pre>

In [35]:
df=pd.read_csv('../ML/dataset/titanic/test.csv', 
               header=None, names=['one','two', 'three', 'four'])

In [36]:
df.head(1)

                                                one   two  three      four
PassengerId Pclass Name Sex Age SibSp Parch  Ticket  Fare  Cabin  Embarked

위에서 보듯이, names를 일부만 정의하면 뒤에서부터 이름이 할당된다.

# <font color=#f94343>Create dataframe<font>

In [3]:
dict_list = [
    {'name':'John', 'age':25, 'job':'student'},
    {'name':'Mark', 'age':32, 'job':'teacher'},
    {'name':'Dore', 'age':40, 'job':'doctor'},
]

In [4]:
df = pd.DataFrame(dict_list)

In [5]:
df

   age      job  name
0   25  student  John
1   32  teacher  Mark
2   40   doctor  Dore

키의 값의 순서가 정해지지 않기 때문에 명시적으로 정해줘야 한다.

In [6]:
header = ['name','age','job']
df = df[header]

In [7]:
df.head()

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40   doctor

한 방에 하려면?

In [8]:
from collections import OrderedDict #key의 순서를 보장한다.

ordered_dict = OrderedDict(
    [
        ('name',['John', 'Mark', 'Dore']),
        ('age', [25, 32, 40]),
        ('job', ['student', 'teacher', 'doctor'])
    ]
)

In [9]:
df = pd.DataFrame.from_dict(ordered_dict)
df.head()

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40   doctor

In [10]:
data_list = [
    ['John', 25, 'student'],
    ['Mark', 32, 'teacher'],
    ['Dore', 40, 'doctor'],
]

In [11]:
header_name = ['name', 'age', 'job']

In [12]:
df = pd.DataFrame.from_records(data_list, columns=header_name)

In [13]:
df.head()

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40   doctor

이것도 한 번에 하려면?

In [14]:
data_list = [
        ['name',['John', 'Mark', 'Dore']],
        ['age', [25, 32, 40]],
        ['job', ['student', 'teacher', None ]]
]

In [15]:
df = pd.DataFrame.from_items(data_list)

C:\Users\guseo\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [16]:
df.head()

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40     None

# <font color=#f94343>Write DataFrame To File<font>

In [17]:
df.to_csv('output.csv')

default : index, header는 True  

row id를 생략하고 싶으면? **index=false**

In [18]:
df.to_csv('output.csv', index=False)

None value는 빈 칸으로 나온다. 

이를 해결하려면? **na_rep = '-'**

In [19]:
df.to_csv('output.csv', index=False, na_rep = 'null')

# <font color=#f94343>Select, Filter Rows Columns<font>

In [20]:
df

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40     None

In [21]:
df[1:3]

   name  age      job
1  Mark   32  teacher
2  Dore   40     None

In [22]:
len(df)

3

len(df)하면 rows를 카운트한다.

In [23]:
df.loc[ [0,2] ] #location : 원하는 row의 인덱스를 넣는다.

   name  age      job
0  John   25  student
2  Dore   40     None

In [24]:
df

   name  age      job
0  John   25  student
1  Mark   32  teacher
2  Dore   40     None

### By column condition

In [25]:
df[df.age>25]

   name  age      job
1  Mark   32  teacher
2  Dore   40     None

In [26]:
df.query('age>25')

   name  age      job
1  Mark   32  teacher
2  Dore   40     None

In [27]:
df[(df.age>=25) & (df.name=='John')]

   name  age      job
0  John   25  student

### Filter Column

#### by index : iloc()

In [28]:
df.iloc[:, 0:2] #모든 row, 0~1 컬럼

   name  age
0  John   25
1  Mark   32
2  Dore   40

#### by column name : df[[]] , filter()

In [29]:
df[ ['name','age'] ]

   name  age
0  John   25
1  Mark   32
2  Dore   40

In [30]:
df.filter(items=['age', 'job'])

   age      job
0   25  student
1   32  teacher
2   40     None

In [32]:
df.filter(like='a', axis=1) #colum 이름에 a가 들어간 것.

   name  age
0  John   25
1  Mark   32
2  Dore   40

In [33]:
df.filter(regex='b$', axis=1) #정규식

       job
0  student
1  teacher
2     None

# <font color=#f94343>Drop row or column<font>

In [39]:
df.drop([0,1]) #index 를 넣어준다.

   name  age   job
2  Dore   40  None

In [ ]:
df.drop([0,1], inplace=True) # 변수에 할당하지 않아도 원본 데이터에 반영된다.

In [40]:
df.drop(df.index[[0,2]])

   name  age      job
1  Mark   32  teacher

drop by age

In [42]:
df[df.age>30]

   name  age      job
1  Mark   32  teacher
2  Dore   40     None

In [43]:
df.drop('age', axis=1) #axis 의 의미 : column 중에서.

   name      job
0  John  student
1  Mark  teacher
2  Dore     None

# <font color=#f94343>Create, Update row column<font>

#### create column

In [44]:
df['salary'] = 0

In [45]:
df

   name  age      job  salary
0  John   25  student       0
1  Mark   32  teacher       0
2  Dore   40     None       0

In [46]:
import numpy as np

np.where

In [50]:
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [49]:
df

   name  age      job salary
0  John   25  student     no
1  Mark   32  teacher    yes
2  Dore   40     None    yes

In [51]:
df['pass_to_birth'] = 0

In [52]:
df['pass_to_birth'] = np.where(df['name'] == 'John', 1, 0)

In [53]:
df

   name  age      job salary  pass_to_birth
0  John   25  student     no              1
1  Mark   32  teacher    yes              0
2  Dore   40     None    yes              0

sum column

In [54]:
df['total'] = df['age'] + df['pass_to_birth']

In [55]:
df

   name  age      job salary  pass_to_birth  total
0  John   25  student     no              1     26
1  Mark   32  teacher    yes              0     32
2  Dore   40     None    yes              0     40

In [74]:
age = []

for row in df['total'] :
    if row <= 29 :
        age.append('Z')
    elif row <= 39 : 
        age.append('Y')
    else : 
        age.append('X')

In [75]:
df['generation'] = age

In [76]:
df

   name  age      job salary  pass_to_birth  total generation
0  John   25  student     no              1     26          Z
1  Mark   32  teacher    yes              0     32          Y
2  Dore   40     None    yes              0     40          X

In [77]:
def is_z(row) :
    if row == 'Z' : 
        return 'Yes'
    else : 
        return 'No'

#### apply

In [78]:
df.generation = df.generation.apply(is_z)

In [80]:
df

   name  age      job salary  pass_to_birth  total generation
0  John   25  student     no              1     26        Yes
1  Mark   32  teacher    yes              0     32         No
2  Dore   40     None    yes              0     40         No

#### feature engineering

In [88]:
dates = [
    {
        'yyyy-mm-dd' : '2000-06-27'
    }, 
    {
        'yyyy-mm-dd' : '2001-03-21'
    }
]

df = pd.DataFrame(dates, columns=['yyyy-mm-dd'])

In [89]:
df

   yyyy-mm-dd
0  2000-06-27
1  2001-03-21

In [90]:
def extract_year(row) :
    return row.split('-')[0]

In [92]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [93]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2001-03-21  2001

In [94]:
data_list = [
    ['John', 25, 'student'],
    ['Mark', 32, 'teacher'],
    ['Dore', 40, 'doctor'],
]

df2 = pd.DataFrame.from_records(data_list)

In [95]:
df2

      0   1        2
0  John  25  student
1  Mark  32  teacher
2  Dore  40   doctor

#### append

In [96]:
df.append(df2, ignore_index = True)

C:\Users\guseo\Anaconda3\lib\site-packages\pandas\core\indexes\api.py:107: RuntimeWarning: '<' not supported between instances of 'str' and 'int', sort order is undefined for incomparable objects
  result = result.union(other)

   yyyy-mm-dd  year     0     1        2
0  2000-06-27  2000   NaN   NaN      NaN
1  2001-03-21  2001   NaN   NaN      NaN
2         NaN   NaN  John  25.0  student
3         NaN   NaN  Mark  32.0  teacher
4         NaN   NaN  Dore  40.0   doctor

# <font color=#f94343>Group By<font>

In [103]:
job = df2.groupby(2)

In [104]:
job.groups

{'doctor': Int64Index([2], dtype='int64'),
 'student': Int64Index([0], dtype='int64'),
 'teacher': Int64Index([1], dtype='int64')}

In [106]:
job.size().reset_index() 
#size : 각 그룹의 row를 count한다. 
#reset_index 하면 원래의 컬럼 이름이 들어간다.

         2  0
0   doctor  1
1  student  1
2  teacher  1

# <font color=#f94343>Drop Duplicate<font>

In [109]:
df2.duplicated().reset_index()

   index      0
0      0  False
1      1  False
2      2  False

In [111]:
df2.drop_duplicates()

      0   1        2
0  John  25  student
1  Mark  32  teacher
2  Dore  40   doctor

duplicate 는 정확하게 같은 row만 잡아낸다.

In [114]:
df2.duplicated([0])

0    False
1    False
2    False
dtype: bool

In [116]:
df2.drop_duplicates([0], keep='first') #첫번째로 나타난 row를 지키기 위해

      0   1        2
0  John  25  student
1  Mark  32  teacher
2  Dore  40   doctor

# <font color=#f94343>Nan을 찾고 원하는 값으로 변경하기<font>

In [117]:
df2.shape

(3, 3)

In [119]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
0    3 non-null object
1    3 non-null int64
2    3 non-null object
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [121]:
df2.isna()

       0      1      2
0  False  False  False
1  False  False  False
2  False  False  False

In [122]:
df2.isnull()

       0      1      2
0  False  False  False
1  False  False  False
2  False  False  False

In [127]:
df2[0] = df2[0].fillna('john doe') #null값을 발견하면 'john doe'로 바꿔줘.

In [128]:
df2

      0   1        2
0  John  25  student
1  Mark  32  teacher
2  Dore  40   doctor

In [132]:
#df2[0] = df2[0].fillna( df.groupby([2])[0].transform('median') )

# <font color=#f94343>Apply<font>

In [133]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2001-03-21  2001

In [134]:
def extract_month(column) :
    return column.split('-')[1]

In [136]:
df['month'] = df['yyyy-mm-dd'].apply(extract_month)

In [137]:
df

   yyyy-mm-dd  year month
0  2000-06-27  2000    06
1  2001-03-21  2001    03

In [138]:
def get_age(year, curr_year) :
    return curr_year - int(year)

In [139]:
df['age'] = df['year'].apply(get_age, curr_year=2019)

In [140]:
df

   yyyy-mm-dd  year month  age
0  2000-06-27  2000    06   19
1  2001-03-21  2001    03   18

In [141]:
def get_intro(age, prefix, suffix) :
    return prefix + str(age) + suffix

In [146]:
df['introduce'] = df['age'].apply(get_intro, prefix="I am ", suffix=" years old")

In [147]:
df

   yyyy-mm-dd  year month  age          introduce
0  2000-06-27  2000    06   19  I am 19 years old
1  2001-03-21  2001    03   18  I am 18 years old

In [148]:
def get_intro2(row) :
    return "I was born in " + str(row.year) + "my age is " + str(row.age)

In [149]:
df.introduce = df.apply(get_intro2, axis=1) #row에다 할 때는 axis=1 사용

In [150]:
df

   yyyy-mm-dd  year month  age                       introduce
0  2000-06-27  2000    06   19  I was born in 2000my age is 19
1  2001-03-21  2001    03   18  I was born in 2001my age is 18

# <font color=#f94343>Map, ApplyMap<font>

In [151]:
dict_list = [
    {'name':'John', 'age':25, 'job':'student'},
    {'name':'Mark', 'age':32, 'job':'teacher'},
    {'name':'Dore', 'age':40, 'job':'doctor'},
]

df = pd.DataFrame(dict_list)

In [152]:
df

   age      job  name
0   25  student  John
1   32  teacher  Mark
2   40   doctor  Dore

In [153]:
df.job = df.job.map({
    'student':1, 'teacher':2, 'doctor':3
})

In [154]:
df

   age  job  name
0   25    1  John
1   32    2  Mark
2   40    3  Dore

In [155]:
import numpy as np

In [157]:
coordination = [
    {'x':5.5, 'y':-5.6, 'z':-1.1},
    {'x':-5.2, 'y':5.5, 'z':-2.2},
    {'x':1.6, 'y':-4.5, 'z':-3.3},
]

df = pd.DataFrame(coordination)

In [158]:
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2  1.6 -4.5 -3.3

**map** : 하나의 컬럼만 변경 

**applymap** : 전체 컬럼 변경

In [161]:
df = df.applymap(np.around) #np.around(반올림)

In [160]:
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2  2.0 -4.0 -3.0

# <font color=#f94343>Unique<font>

In [163]:
dict_list = [
    {'name':'John', 'age':25, 'job':'student'},
    {'name':'Mark', 'age':32, 'job':'teacher'},
    {'name':'Dore', 'age':40, 'job':'doctor'},
]

df = pd.DataFrame(dict_list)

In [164]:
df.job.unique()

array(['student', 'teacher', 'doctor'], dtype=object)

In [165]:
df.job.value_counts()

student    1
teacher    1
doctor     1
Name: job, dtype: int64

# <font color=#f94343>Concatnate Two Dataframes<font>

In [166]:
dict_list = [
    {'name':'Jenny', 'age':25, 'job':'student'},
    {'name':'Jessica', 'age':32, 'job':'teacher'},
    {'name':'Minsu', 'age':40, 'job':'doctor'},
]

df2 = pd.DataFrame(dict_list)

In [168]:
df

   age      job  name
0   25  student  John
1   32  teacher  Mark
2   40   doctor  Dore

In [169]:
df2

   age      job     name
0   25  student    Jenny
1   32  teacher  Jessica
2   40   doctor    Minsu

In [172]:
result = pd.concat([df,df2])
#result = pd.concat([df,df2], ignore_index=True)

In [173]:
result

   age      job     name
0   25  student     John
1   32  teacher     Mark
2   40   doctor     Dore
0   25  student    Jenny
1   32  teacher  Jessica
2   40   doctor    Minsu

In [177]:
result = df.append(df2)
# result = df.append(df2, ignore_index=True)

In [178]:
result

   age      job     name
0   25  student     John
1   32  teacher     Mark
2   40   doctor     Dore
3   25  student    Jenny
4   32  teacher  Jessica
5   40   doctor    Minsu

### 열을 합치기

In [180]:
result = pd.concat([df, df2], axis=1) #axis : 열로 넣어라

In [181]:
result

   age      job  name  age      job     name
0   25  student  John   25  student    Jenny
1   32  teacher  Mark   32  teacher  Jessica
2   40   doctor  Dore   40   doctor    Minsu

### 리스트 합치기 : 실제값과 예측값을 비교할 때

In [182]:
label = [1,2,3,4,5] #실제값
prediction = [1,2,2,4,4] #예측값

In [183]:
comparison = pd.DataFrame({'label' : label, 'prediction': prediction})

In [184]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4